#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
@desc: 基础常量定义
@time: 2019/7/25
"""

# CBETA藏经代码
canon_maps = {
    'A': ('ZC', '趙城金藏'),
    'B': ('', '補編'),
    'C': ('ZH', '中華藏'),
    'D': ('', '國圖'),
    'F': ('FS', '房山石經'),
    'G': ('', '佛教大藏經'),
    'GA': ('', '佛寺志彙'),
    'GB': ('', '佛寺志叢'),
    'I': ('', '北朝佛拓'),
    'J': ('JS', '嘉興藏'),
    'K': ('GL', '高麗藏'),
    'L': ('QL', '乾隆藏'),
    'M': ('', '卍正藏'),
    'N': ('', '南傳'),
    'P': ('YB', '永樂北藏'),
    'Q': ('QS', '磧砂藏'),
    'R': ('', '卍續藏'),
    'S': ('', '宋藏遺珍'),
    'T': ('TS', '大正藏'),
    'U': ('HW', '洪武南藏'),
    'X': ('', '卍新續藏'),
    'Y': ('', '印順'),
    'Z': ('', '卍大日本續藏經'),
    'ZS': ('', '正史'),
    'ZW': ('', '藏外')
}
